<script setup lang="ts">
import Section from "~/components/Segment.vue";

const data = reactive({
  seg1: {
    id: "1",
    cls: "seg-1",
    head: "Мирна Україна",
    subhead: "В якій нам жити.",
    cnt: "Уяви: тихий вечір у Києві, люди гуляють набережною, десь лунає жива музика. Ніяких тривог, ніяких втрат, тільки спокійне життя, яке давно мало бути нормою. Заводи працюють на економіку, а не на оборону, а замість зборів на дрони збирають на стартапи, дослідження і аніме фестивалі.",
    svg: "0"
  },
  seg2: {
    id: "2",
    cls: "seg-2",
    head: "Палаючі кацапи",
    subhead: "Зробимо їм пекло.",
    cnt: "Вони думали, що їх боятимуться, а стали ходячими мішенями. Всі їхні \"аналоговнєт\" горять від найдешевших FPV-дронів, техніка застрягає в багнюці, а склади вибухають частіше, ніж вони встигають їх поповнити. Війна, яку вони розв’язали, стала їхнім персональним пеклом.",
    svg: "1"
  },
  seg3: {
    id: "3",
    cls: "seg-3",
    head: "Армія дронів",
    subhead: "На захисті 24/7, шоб ше раз не полізли.",
    cnt: "Колись війни вигравали ті, у кого більше людей і танків. Тепер важливіше, у кого більше пультів та батарейок. Дрони бачать усе, завдають ударів там, де цього не чекають, і роблять фронт нестерпним для ворога. Майбутнє вже настало, й у ньому перемога вирішується алгоритмами та операторами в піксельних формах.",
    svg: "2"
  },
})
</script>

<template>
  <Section v-for="seg in data" :key="seg.id" v-bind="seg"></Section>
</template>

<style scoped>

</style>